backend/backend/src/main/java/com/app/backend/testingFiles/ApacheJMeter_Test1646740671619.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan jmeter="5.4" properties="5.0" version="1.2">
   <hashTree>
      <TestPlan enabled="true"
                guiclass="TestPlanGui"
                testclass="TestPlan"
                testname="Test Plan">
         <boolProp name="TestPlan.functional_mode">false</boolProp>
         <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
         <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
         <elementProp elementType="Arguments"
                      enabled="true"
                      guiclass="ArgumentsPanel"
                      name="TestPlan.user_defined_variables"
                      testclass="Arguments"
                      testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
         </elementProp>
      </TestPlan>
      <hashTree>
         <ThreadGroup enabled="true"
                      guiclass="ThreadGroupGui"
                      testclass="ThreadGroup"
                      testname="Thread Group">
            <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
            <elementProp elementType="LoopController"
                         enabled="true"
                         guiclass="LoopControlPanel"
                         name="ThreadGroup.main_controller"
                         testclass="LoopController"
                         testname="Loop Controller">
               <boolProp name="LoopController.continue_forever">false</boolProp>
               <stringProp name="LoopController.loops">5</stringProp>
            </elementProp>
            <stringProp name="ThreadGroup.num_threads">3</stringProp>
            <stringProp name="ThreadGroup.ramp_time">1</stringProp>
            <boolProp name="ThreadGroup.scheduler">false</boolProp>
            <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
         </ThreadGroup>
         <hashTree>
            <HTTPSamplerProxy enabled="true"
                              guiclass="HttpTestSampleGui"
                              testclass="HTTPSamplerProxy"
                              testname="HTTP Request">
               <elementProp elementType="Arguments"
                            enabled="true"
                            guiclass="HTTPArgumentsPanel"
                            name="HTTPsampler.Arguments"
                            testclass="Arguments"
                            testname="User Defined Variables">
                  <collectionProp name="Arguments.arguments">
                     <elementProp elementType="HTTPArgument" name="">
                        <boolProp name="HTTPArgument.always_encode">true</boolProp>
                        <stringProp name="Argument.metadata">=</stringProp>
                        <boolProp name="HTTPArgument.use_equals">true</boolProp>
                     </elementProp>
                  </collectionProp>
               </elementProp>
               <stringProp name="HTTPSampler.domain">localhost/SentimentAnalyzer</stringProp>
               <stringProp name="HTTPSampler.port">80</stringProp>
               <stringProp name="HTTPSampler.protocol">HTTP</stringProp>
               <stringProp name="HTTPSampler.path">/</stringProp>
               <stringProp name="HTTPSampler.method">GET</stringProp>
               <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
               <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
               <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
               <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            </HTTPSamplerProxy>
            <hashTree>
               <ResultCollector enabled="true"
                                guiclass="TableVisualizer"
                                testclass="ResultCollector"
                                testname="View Results in Table">
                  <boolProp name="ResultCollector.error_logging">false</boolProp>
               </ResultCollector>
               <hashTree/>
            </hashTree>
         </hashTree>
      </hashTree>
   </hashTree>
</jmeterTestPlan>